package com.excitingboat.freshmanspecial.config;

/**
 * Created by PinkD on 2016/8/7.
 * Data
 */
public class Data {

    public static final String[] SCHOOL = new String[]{"请选择学院", "光电工程学院/重庆国际半导体学院 ",
            "经济管理学院 ", "国际学院", "法学院", "传媒艺术学院 ", "通信与信息工程学院 ",
            "计算机科学与技术学院", "软件工程学院", "体育学院", "生物信息学院", "理学院",
            "先进制造工程学院", "外国语学院", "自动化学院 "};
    public static final String[][] MAJOR = new String[][]{{"广播电视编导", "数字媒体艺术与动画类", "艺术设计类"},
            {"法学类"}, {"电子工程类", "集成电路工程类"}, {"电子信息工程", "软件工程"}, {"计算机与智能科学类"},
            {"电子商务类", "工程管理", "工商管理类", "经济学", "信息管理与信息系统"}, {"数理科学与信息技术类"},
            {"软件工程"}, {"生物信息学", "生物医学工程"}, {"社会体育指导与管理"}, {"广电与数字媒体类", "通信信息类"},
            {"英语类"}, {"先进制造类"}, {"自动化与电气工程类"}};
    public static final int[] COLORS = new int[]{0xFF66CCFF, 0xFFEE82EE, 0xFF8DF495, 0xFF9999FF, 0xFFFC7AFC};
    public static final double[][] MAN_WOMAN = new double[][]{{235, 67}, {73, 45}, {75, 25}, {34, 69},
            {49, 12}, {86, 118}, {60, 178}, {79, 53}, {205, 26}, {458, 116}, {42, 31}, {443, 85},
            {85, 15}, {46, 15}, {48, 24}, {47, 44}, {141, 54}, {63, 106}, {399, 126}, {251, 25},
            {67, 40}, {55, 123}, {15, 67}, {472, 102}};

    public static final String[][] HARD_SUBJECT = new String[][]{
            {"电子电路", "大学物理", "大学物理", "大学物理", "数学分析", "高等数学", "概率论", "运动解剖学", "基础英语", "工程图学", "视听说", "高等数学", "刑法", "软件设计基础"},
            {"高等数学", "高等数学", "概率论", "高等数学", "高等数学", "视听说", "高等数学", "体育概论", "英语语音", "大学物理", "读写译", "离散数学", "民法", "线性代数"},
            {"大学物理", "线性代数", "工程图学", "C语言", "大学物理", "化学", "C语言", "健美操", "英语阅读", "高等数学", "美术史", "C++", "法理", "大学物理"}
    };
    public static final double[][] HARD_SUBJECT_PERCENT = new double[][]{
            {62.00, 40.00, 54.00, 45.00, 49.00, 45.00, 42.00, 56.00, 44.55, 55.00, 43.00, 56.00, 54.90, 52.00},
            {18.00, 35.00, 26.00, 30.00, 28.00, 31.00, 38.00, 22.00, 28.18, 24.00, 32.00, 23.00, 24.51, 32.00},
            {20.00, 25.00, 20.00, 25.00, 23.00, 24.00, 20.00, 22.00, 27.27, 21.00, 25.00, 21.00, 20.59, 16.00}
    };

    public static final String[] JOB_TYPE = new String[]{"签就业协议", "升学出国", "待就业", "灵活就业"};
    public static final double[][] JOB_PERCENT = new double[][]{};

}

/*

75.60%
73.02%
71.06%
81.35%
77.85%
71.64%
85.61%
86.67%
84.38%
85.71%
82.64%
86.97%
63.75%
76.03%


22.23%
21.50%
23.40%
17.25%
14.56%
23.51%
9.30%
11.67%
15.63%
10.08%
10.60%
7.04%
31.25%
18.49%


2.08%
4.67%
5.53%
1.04%
5.06%
4.48%
5.09%
1.67%
0.00%
4.20%
2.61%
4.58%
5.00%
5.48%


0.09%
0.81%
0.01%
0.36%
2.53%
0.37%
0.00%
0.00%
0.00%
0.01%
4.15%
1.41%
0.00%
0.00%


 */